# --- Core CLI ---
brew "git"
brew "git-lfs"
brew "gh"
brew "wget"
brew "mkcert"

# --- Shell / UX ---
brew "starship"
brew "stow"
brew "direnv"
brew "zoxide"
brew "eza"
brew "bat"
brew "tldr"
brew "tree"
brew "zsh-autosuggestions"

# --- Search / text / data ---
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"

# --- Monitoring ---
brew "bottom"

# --- Language / tool managers ---
brew "fnm"
brew "asdf"
brew "rustup"

# --- Cloud / IaC ---
brew "azure-cli"

# --- Python tooling ---
brew "uv"

# --- Terminal multiplexer ---
brew "tmux"

# --- Synergy ---
brew "gettext"
brew "nss"


# --- OpenCode ---
tap "anomalyco/tap"
brew "opencode"

# --- Terminal ---
cask "kitty"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"
