# --- Core CLI ---
brew "git"
brew "git-lfs"
brew "git-delta"
brew "gh"
brew "wget"
brew "mkcert"

# --- Shell / UX ---
brew "starship"
brew "stow"
brew "direnv"
brew "zoxide"
brew "eza"
brew "bat"
brew "tldr"
brew "tree"
brew "zsh-autosuggestions"

# --- Search / text / data ---
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"

# --- Monitoring ---
brew "bottom"

# --- Language / tool managers ---
brew "fnm"
brew "asdf"
brew "rustup"
brew "go"

# --- Kubernetes / Operators ---
brew "operator-sdk"
brew "kubernetes-cli"
brew "kustomize"
brew "helm"
brew "kind"
tap "azure/kubelogin"
brew "azure/kubelogin/kubelogin"

# --- Cloud / IaC ---
tap "azure/functions"
brew "azure-cli"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# --- Python tooling ---
brew "uv"
brew "python@3.11"

# --- Dev tooling ---
brew "pre-commit"

# --- Terminal multiplexer ---
brew "tmux"

# --- Agent multiplexer ---
brew "herdr"

# --- Synergy ---
brew "gettext"
brew "nss"


# --- OpenCode ---
tap "anomalyco/tap"
brew "opencode"

# --- Notifications ---
brew "terminal-notifier"

# --- Terminal ---
cask "kitty"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"

# --- Networking ---
cask "wireshark"

# --- Media ---
brew "ffmpeg"

tap "bensincs/tap"
cask "webshow"
